app/Models/Usuario_Model.php

    public function verificarCredenciais($nomeUsuario, $senha)
    {

        // Consulta para verificar se as credenciais estão corretas
        $query = $this->where('nome', $nomeUsuario)
            ->where('senha', $senha)
            ->get();
---
SELECT *
FROM `usuario`
WHERE `nome` = 'Cleytinho'
AND `senha` = 'd'